# Exerc√≠cio

0 -Crie um DataFrame com os nomes, idades, pesos e alturas dos estudantes da turma (Essas informa√ß√µes n√£o necessariamente precisam corresponder √† realidade!)

1- Inclua uma nova coluna no DataFrame contendo o IMC de cada estudante ( ùëùùëíùë†ùëú/ùëéùëôùë°ùë¢ùëüùëé2 ) e  Salve o DataFrame em um arquivo xlsx e abra no excel para ver o resultado

3- Crie um DataFrame contendo apenas nomes e idades

4- Crie um DataFrame contendo apenas os 4 estudantes mais altos

5- Crie um novo DataFrame ordenado pelo IMC

6- Determine quem √© o estudante mais alto, quem √© o mais novo e a soma dos pesos de todos os estudantes

7- Calcule a m√©dia e o desvio padr√£o dos valores de IMC

In [172]:
#1
import pandas as pd
alunos = {"Nomes": ["Karla", "Leandro", "Luiza", "Cec√≠lia", "Rafael"],
       "Idades": [30, 27, 29, 4, 10],
       "Peso": [57, 70, 66, 16, 45],
       "Altura": [1.55, 1.70, 1.68, 1.10, 1.40] }
df = pd.DataFrame(alunos)
df.set_index("Nomes")

         Idades  Peso  Altura
Nomes
Karla        30    57    1.55
Leandro      27    70    1.70
Luiza        29    66    1.68
Cec√≠lia       4    16    1.10
Rafael       10    45    1.40

In [173]:
#2
df.to_excel('IMC.xlsx', index=False)
df = pd.read_excel("IMC.xlsx", index_col = "Nomes")
df["IMC"] = df["Peso"] / df["Altura"]**2
df.to_excel('IMC.xlsx', index=False)
df

         Idades  Peso  Altura        IMC
Nomes
Karla        30    57    1.55  23.725286
Leandro      27    70    1.70  24.221453
Luiza        29    66    1.68  23.384354
Cec√≠lia       4    16    1.10  13.223140
Rafael       10    45    1.40  22.959184

In [174]:
#3
df_ni = df.loc[:,["Idades"]]
df_ni

         Idades
Nomes
Karla        30
Leandro      27
Luiza        29
Cec√≠lia       4
Rafael       10

In [175]:
#4
df_altos = df.loc[:,["Altura"]]
df_altos = df_altos.sort_values(by="Altura",ascending=False)
df_altos.head(4)

         Altura
Nomes
Leandro    1.70
Luiza      1.68
Karla      1.55
Rafael     1.40

In [177]:
#5
df_imc = df.loc[:,["IMC"]]
df_imc = df_imc.sort_values(by="IMC",ascending=True)
df_imc

               IMC
Nomes
Cec√≠lia  13.223140
Rafael   22.959184
Luiza    23.384354
Karla    23.725286
Leandro  24.221453

In [193]:
#6
#mais alto
a = df_altos.max()
print("Mais alto:")
df_altos.loc[df_altos['Altura']==a[0]]

Mais alto:

         Altura
Nomes
Leandro     1.7

In [194]:
#6
#mais novo
b = df_ni.min()
print ("Mais novo: ")
df_ni.loc[df_ni['Idades']==b[0]]

Mais novo:

         Idades
Nomes
Cec√≠lia       4

In [196]:
#6
#Soma dos pesos
df_peso = df.loc[:,["Peso"]]
df_peso.sum()

Peso    254
dtype: int64

In [208]:
media = df_imc.mean()[0]
print("Media:", media)
desvio = df_imc.std()[0]
print("Desvio",desvio)

Media: 21.502683471656148
Desvio 4.651466966222887